src/cpp.org
#+title: C++

-----
- The C Programming Language(DMR & BWK)
- C and Pointers
- The C++ Programming Language(BS)
- Thinking in C++
- http://www.cplusplus.com/doc/tutorial/
- https://isocpp.org/get-started

** philosphy
C++语言设计上有两个基本点： https://www.stroustrup.com/ETAPS-corrected-draft.pdf
- A simple and direct mapping to hardware 完全地操控硬件
- Zero-overhead abstraction mechanisms 没有开销的抽象机制

下面是 《TCPL》这本书里面的一些话：

#+BEGIN_QUOTE
学习C++时，最主要的事情就是集中关注概念，不要迷失在语言的技术细节里面，学习语言的目的是成为一个更好的程序员，对于程序设计和设计技术的理解远远比语言细节重要.在实践性程序设计中，理解语言中最晦涩难懂的语言特征或者使用大量的不同特征并不能够获得什么利益:-).C++支持一种逐步推进的学习方式，就是说一开始就可以来使用C++编写实际的东西，同时C++支持多种程序设计范型，能够使得你大致线形地学习它的概念，并且在学习过程中不断收到实际效益。

OOP允许程序员用问题本身的属于来描述问题，而不是要用运行解决方案的计算机术语来描述问题。人们已经对OOP语言有了这样的看法，就是程序员应该抛弃所知道的所有事情并且从一组新的概念和文法重新开始，程序员应当相信从长远观点来看，最好还是丢掉所有来自过程语言的老行装。没错从长远观点来看，这是对的，但是从短期角度来看，这些行装确实有价值的。C++成功的原因是很经济的，转变到OOP需要代价但是C++尽可能让代价小。

关于C++标准库的忠告:
- 不要像重新发明轮子一样去做每一件事情，使用库。
- 不要相信奇迹，理解你的库能够做什么如何做，代价多大。
- 不要认为为标准库对于任何事情都是最理想的。
#+END_QUOTE

** language
*** new/delete
new/delete和C的内存分配有很多区别，主要的改进在进行了很多可定制化的内容:
   * new/delete作为运算符而不是函数存在，因此可以重载来进行内存分配的定制
   * 在new/delete对象的时候会调用分配对象的构造和析构函数
   * new/delete对象的时候区分了new/delete和new/delete [](主要原因还是因为需要调用构造和析构函数):-)
   * 支持放置语法，就是传入一个信息告诉分配函数希望在哪个地方进行分配
   * 加入了异常分配失败抛出bad_alloc
   * 提供了一种方法设置handler在分配失败的时候调用set_new_handler()
   * 默认的new还进行检查以确信在传递地址给构造函数之前内存分配成功
   * 允许重载全局new/delete和某个类的new/delete

**** new重载
用户可以重载new/delete来实现全局new/delete或者是某个类的new/delete.原型有下面这些
#+BEGIN_SRC C++
// #include <new>
void* operator new(std::size_t) throw (std::bad_alloc);
void* operator new[](std::size_t) throw (std::bad_alloc);
void operator delete(void*) throw();
void operator delete[](void*) throw();
void* operator new(std::size_t, const std::nothrow_t&) throw();
void* operator new[](std::size_t, const std::nothrow_t&) throw();
void operator delete(void*, const std::nothrow_t&) throw();
void operator delete[](void*, const std::nothrow_t&) throw();

// Default placement versions of operator new.
inline void* operator new(std::size_t, void* __p) throw() { return __p; }
inline void* operator new[](std::size_t, void* __p) throw() { return __p; }

// Default placement versions of operator delete.
inline void  operator delete  (void*, void*) throw() { }
inline void  operator delete[](void*, void*) throw() { }
#+END_SRC

new/delete如果作为类成员的话被重载的话，始终是静态成员，即使你不这样声明也是如此，这个事实意味着这些运算符不接受this指针。其实这也是非常容易考虑到的，new/delete本来就是来分配内存使用的。new在初始化构造之前调用，而delete是在析构函数调用之后调用，所以非静态数据成员肯定不能够被访问:-)此外new/delete是可以继承的,调用的还是基类的new/delete函数，只不过内存大小不同。

#+BEGIN_SRC C++
#include <iostream>
#include <new>
class A{
 public:
  void* operator new(size_t s,int arg) throw(std::bad_alloc) {
    std::cout << "size : " << s << ", arg : " << arg << std::endl;
    return ::operator new(s);
  }
  void* operator new(size_t s,int arg,const std::nothrow_t& nothrow){
    std::cout << "[nothrow]size : " << s << ", arg : " << arg << std::endl;
    return ::operator new(s,nothrow);
  }
  void operator delete(void* p) {
    ::operator delete(p);
  }
  int x;
};
class B: public A{
  int y;
};

int main(){
  A* a=new (10,std::nothrow)A();
  B* b=new (20)B();
  delete a;
  delete b;
}
#+END_SRC

