html/cpp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C++</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">C++</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. philosphy</a></li>
<li><a href="#sec-2">2. language</a>
<ul>
<li><a href="#sec-2-1">2.1. new/delete</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. new重载</a></li>
<li><a href="#sec-2-1-2">2.1.2. new异常规格</a></li>
<li><a href="#sec-2-1-3">2.1.3. 内存分配失败</a></li>
<li><a href="#sec-2-1-4">2.1.4. operator new与new operator</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. static assert</a></li>
<li><a href="#sec-2-3">2.3. 各种cast</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. 问题抽象</a></li>
<li><a href="#sec-2-3-2">2.3.2. 多重继承</a></li>
<li><a href="#sec-2-3-3">2.3.3. 正确使用cast</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. runtime</a>
<ul>
<li><a href="#sec-3-1">3.1. local static object</a></li>
<li><a href="#sec-3-2">3.2. hook function</a></li>
<li><a href="#sec-3-3">3.3. undefined reference to static const class member</a></li>
<li><a href="#sec-3-4">3.4. malloc warmup performance</a></li>
</ul>
</li>
<li><a href="#sec-4">4. library</a>
<ul>
<li><a href="#sec-4-1">4.1. boost::bind</a></li>
<li><a href="#sec-4-2">4.2. boost::python</a></li>
<li><a href="#sec-4-3">4.3. 几个logging实现</a></li>
</ul>
</li>
<li><a href="#sec-5">5. C++11 update</a>
<ul>
<li><a href="#sec-5-1">5.1. suffix return type syntax(返回值类型后置语法)</a></li>
<li><a href="#sec-5-2">5.2. lambda expression(lambda表达式，匿名函数)</a></li>
<li><a href="#sec-5-3">5.3. rvalue references and move semantics(右值引用以及移动语义)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr  />
<ul class="org-ul">
<li>The C Programming Language(DMR &amp; BWK)
</li>
<li>C and Pointers
</li>
<li>The C++ Programming Language(BS)
</li>
<li>Thinking in C++
</li>
<li><a href="http://www.cplusplus.com/doc/tutorial/">http://www.cplusplus.com/doc/tutorial/</a>
</li>
<li><a href="https://isocpp.org/get-started">https://isocpp.org/get-started</a>
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> philosphy</h2>
<div class="outline-text-2" id="text-1">
<p>
C++语言设计上有两个基本点： <a href="https://www.stroustrup.com/ETAPS-corrected-draft.pdf">https://www.stroustrup.com/ETAPS-corrected-draft.pdf</a>
</p>
<ul class="org-ul">
<li>A simple and direct mapping to hardware 完全地操控硬件
</li>
<li>Zero-overhead abstraction mechanisms 没有开销的抽象机制
</li>
</ul>

<p>
下面是 《TCPL》这本书里面的一些话：
</p>

<blockquote>
<p>
学习C++时，最主要的事情就是集中关注概念，不要迷失在语言的技术细节里面，学习语言的目的是成为一个更好的程序员，对于程序设计和设计技术的理解远远比语言细节重要.在实践性程序设计中，理解语言中最晦涩难懂的语言特征或者使用大量的不同特征并不能够获得什么利益:-).C++支持一种逐步推进的学习方式，就是说一开始就可以来使用C++编写实际的东西，同时C++支持多种程序设计范型，能够使得你大致线形地学习它的概念，并且在学习过程中不断收到实际效益。
</p>

<p>
OOP允许程序员用问题本身的属于来描述问题，而不是要用运行解决方案的计算机术语来描述问题。人们已经对OOP语言有了这样的看法，就是程序员应该抛弃所知道的所有事情并且从一组新的概念和文法重新开始，程序员应当相信从长远观点来看，最好还是丢掉所有来自过程语言的老行装。没错从长远观点来看，这是对的，但是从短期角度来看，这些行装确实有价值的。C++成功的原因是很经济的，转变到OOP需要代价但是C++尽可能让代价小。
</p>

<p>
关于C++标准库的忠告:
</p>
<ul class="org-ul">
<li>不要像重新发明轮子一样去做每一件事情，使用库。
</li>
<li>不要相信奇迹，理解你的库能够做什么如何做，代价多大。
</li>
<li>不要认为为标准库对于任何事情都是最理想的。
</li>
</ul>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> language</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> new/delete</h3>
<div class="outline-text-3" id="text-2-1">
<p>
new/delete和C的内存分配有很多区别，主要的改进在进行了很多可定制化的内容:
</p>
<ul class="org-ul">
<li>new/delete作为运算符而不是函数存在，因此可以重载来进行内存分配的定制
</li>
<li>在new/delete对象的时候会调用分配对象的构造和析构函数
</li>
<li>new/delete对象的时候区分了new/delete和new/delete [](主要原因还是因为需要调用构造和析构函数):-)
</li>
<li>支持放置语法，就是传入一个信息告诉分配函数希望在哪个地方进行分配
</li>
<li>加入了异常分配失败抛出bad_alloc
</li>
<li>提供了一种方法设置handler在分配失败的时候调用set_new_handler()
</li>
<li>默认的new还进行检查以确信在传递地址给构造函数之前内存分配成功
</li>
<li>允许重载全局new/delete和某个类的new/delete
</li>
</ul>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> new重载</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
用户可以重载new/delete来实现全局new/delete或者是某个类的new/delete.原型有下面这些
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">// </span><span class="org-comment">#include &lt;new&gt;</span>
<span class="org-type">void</span>* <span class="org-keyword">operator</span> <span class="org-keyword">new</span>(<span class="org-constant">std</span>::size_t) <span class="org-keyword">throw</span> (<span class="org-constant">std</span>::<span class="org-type">bad_alloc</span>);
<span class="org-type">void</span>* <span class="org-keyword">operator</span> <span class="org-keyword">new</span>[](<span class="org-constant">std</span>::size_t) <span class="org-keyword">throw</span> (<span class="org-constant">std</span>::<span class="org-type">bad_alloc</span>);
<span class="org-type">void</span> <span class="org-keyword">operator</span> <span class="org-keyword">delete</span>(<span class="org-type">void</span>*) <span class="org-keyword">throw</span>();
<span class="org-type">void</span> <span class="org-keyword">operator</span> <span class="org-keyword">delete</span>[](<span class="org-type">void</span>*) <span class="org-keyword">throw</span>();
<span class="org-type">void</span>* <span class="org-keyword">operator</span> <span class="org-keyword">new</span>(<span class="org-constant">std</span>::size_t, <span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">nothrow_t</span>&amp;) <span class="org-keyword">throw</span>();
<span class="org-type">void</span>* <span class="org-keyword">operator</span> <span class="org-keyword">new</span>[](<span class="org-constant">std</span>::size_t, <span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">nothrow_t</span>&amp;) <span class="org-keyword">throw</span>();
<span class="org-type">void</span> <span class="org-keyword">operator</span> <span class="org-keyword">delete</span>(<span class="org-type">void</span>*, <span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">nothrow_t</span>&amp;) <span class="org-keyword">throw</span>();
<span class="org-type">void</span> <span class="org-keyword">operator</span> <span class="org-keyword">delete</span>[](<span class="org-type">void</span>*, <span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">nothrow_t</span>&amp;) <span class="org-keyword">throw</span>();

<span class="org-comment-delimiter">// </span><span class="org-comment">Default placement versions of operator new.</span>
<span class="org-keyword">inline</span> <span class="org-type">void</span>* <span class="org-keyword">operator</span> <span class="org-keyword">new</span>(<span class="org-constant">std</span>::size_t, <span class="org-type">void</span>* <span class="org-variable-name">__p</span>) <span class="org-keyword">throw</span>() { <span class="org-keyword">return</span> __p; }
<span class="org-keyword">inline</span> <span class="org-type">void</span>* <span class="org-keyword">operator</span> <span class="org-keyword">new</span>[](<span class="org-constant">std</span>::size_t, <span class="org-type">void</span>* <span class="org-variable-name">__p</span>) <span class="org-keyword">throw</span>() { <span class="org-keyword">return</span> __p; }

<span class="org-comment-delimiter">// </span><span class="org-comment">Default placement versions of operator delete.</span>
<span class="org-keyword">inline</span> <span class="org-type">void</span>  <span class="org-keyword">operator</span> <span class="org-keyword">delete</span>  (<span class="org-type">void</span>*, <span class="org-type">void</span>*) <span class="org-keyword">throw</span>() { }
<span class="org-keyword">inline</span> <span class="org-type">void</span>  <span class="org-keyword">operator</span> <span class="org-keyword">delete</span>[](<span class="org-type">void</span>*, <span class="org-type">void</span>*) <span class="org-keyword">throw</span>() { }
</pre>
</div>

<p>
new/delete如果作为类成员的话被重载的话，始终是静态成员，即使你不这样声明也是如此，这个事实意味着这些运算符不接受this指针。其实这也是非常容易考虑到的，new/delete本来就是来分配内存使用的。new在初始化构造之前调用，而delete是在析构函数调用之后调用，所以非静态数据成员肯定不能够被访问:-)此外new/delete是可以继承的,调用的还是基类的new/delete函数，只不过内存大小不同。
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;new&gt;</span>
<span class="org-keyword">class</span> <span class="org-type">A</span>{
 <span class="org-keyword">public</span>:
  <span class="org-type">void</span>* <span class="org-keyword">operator</span> <span class="org-keyword">new</span>(<span class="org-type">size_t</span> <span class="org-variable-name">s</span>,<span class="org-type">int</span> <span class="org-variable-name">arg</span>) <span class="org-keyword">throw</span>(<span class="org-constant">std</span>::<span class="org-type">bad_alloc</span>) {
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"size : "</span> &lt;&lt; s &lt;&lt; <span class="org-string">", arg : "</span> &lt;&lt; arg &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-keyword">return</span> ::<span class="org-keyword">operator</span> <span class="org-keyword">new</span>(<span class="org-type">s</span>);
  }
  <span class="org-type">void</span>* <span class="org-keyword">operator</span> <span class="org-keyword">new</span>(<span class="org-type">size_t</span> <span class="org-variable-name">s</span>,<span class="org-type">int</span> <span class="org-variable-name">arg</span>,<span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">nothrow_t</span>&amp; <span class="org-variable-name">nothrow</span>){
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"[nothrow]size : "</span> &lt;&lt; s &lt;&lt; <span class="org-string">", arg : "</span> &lt;&lt; arg &lt;&lt; <span class="org-constant">std</span>::endl;
    <span class="org-keyword">return</span> ::<span class="org-keyword">operator</span> <span class="org-keyword">new</span>(<span class="org-type">s</span>,nothrow);
  }
  <span class="org-type">void</span> <span class="org-keyword">operator</span> <span class="org-keyword">delete</span>(<span class="org-type">void</span>* <span class="org-variable-name">p</span>) {
    ::<span class="org-keyword">operator</span> <span class="org-keyword">delete</span>(p);
  }
  <span class="org-type">int</span> <span class="org-variable-name">x</span>;
};
<span class="org-keyword">class</span> <span class="org-type">B</span>: <span class="org-keyword">public</span> <span class="org-type">A</span>{
  <span class="org-type">int</span> <span class="org-variable-name">y</span>;
};

<span class="org-type">int</span> <span class="org-function-name">main</span>(){
  <span class="org-type">A</span>* <span class="org-variable-name">a</span>=<span class="org-keyword">new</span> (10,<span class="org-constant">std</span>::nothrow)<span class="org-type">A</span>();
  <span class="org-type">B</span>* <span class="org-variable-name">b</span>=<span class="org-keyword">new</span> (20)<span class="org-type">B</span>();
  <span class="org-keyword">delete</span> a;
  <span class="org-keyword">delete</span> b;
}
</pre>
</div>
</div>
</div>
