src/cpp.org
**** new异常规格
从new的异常规格可以看到，如果是普通的调用的话可能会抛出std::bad_alloc这个异常，但是原型里面还有
#+BEGIN_SRC C++
void* operator new(std::size_t, const std::nothrow_t&) throw();
#+END_SRC
这种使用placement来通知new不抛出异常的的接口，语义是返回NULL来告诉app分配失败。要使用这个函数也非常简单
#+BEGIN_SRC C++
// #include <new>
//  struct nothrow_t { };
//  extern const nothrow_t nothrow;
void* p=new (std::nothrow) int(); // 这里std::nothrow就是std::nothrow_t的实例
#+END_SRC
通过函数重载来达到这个目的，这个方法值得借鉴。

**** 内存分配失败
C++来提供了内存分配失败的回调函数，但是这个只能够处理全局new分配失败的情况
#+BEGIN_SRC C++
  /** If you write your own error handler to be called by @c new, it must
   *  be of this type.  */
  typedef void (*new_handler)();
  /// Takes a replacement handler as the argument, returns the previous handler.
  new_handler set_new_handler(new_handler) throw();
#+END_SRC

**** operator new与new operator
此外在很多书籍里面会提到operator new和new operator这两个说法，这两个是不一样的概念。operator new就是我们重写运算符函数，而new operator使我们调用new这个表达式。本质上说new这个表达式调用了分配类型里面的operator new函数，同时调用这个类型的初始化构造函数。同理operator delete和delete operator差别也是一样的。通常new operator的动作是这样的:
- void *raw=operaotor new(sizeof(A)); //使用operator new进行内存分配
- call A::A on *raw; //在raw上面调用构造函数
- A *a=static_castraw; //最后进行一次强制转换
同理通常delete operator的动作是这样的:
- a->~A();//调用一次析构函数
- operator delete(a);//进行内存释放
说到这里，我们需要清楚为什么需要有new []和delete []的方法了。对于operator new和delete来说真的不关心这些，因为只是分配内存，而对于new operator和delete operator就需要关心了，因为需要关心有多少个对象，这样的话才能够调用每个对象的构造函数。调用了new []分配的对象也一定需要使用delete []来释放，不然只会调用第一个元素析构函数和释放它的空间。

*** static assert
#+BEGIN_SRC C++
#define STATIC_ASSERT(_cond,_name)      typedef char STATIC_ASSERT_FAILED_ ## _name [ (_cond) ? 1 : -1 ]
#define STATIC_SIZE_ASSERT(_type,_size) STATIC_ASSERT ( sizeof(_type)==_size, _type ## _MUST_BE_ ## _size ## _BYTES )
#+END_SRC

这个宏用来检测sizeof(_type)==_size这个假设，这个可以在编译代码的时候可以进行断言。好比下面这段程序

#+BEGIN_SRC C++
int main() {
  STATIC_SIZE_ASSERT(int,8);
  return 0;
}
#+END_SRC

那么编译就会出现
#+BEGIN_EXAMPLE
main.cc:5: error: size of array `STATIC_ASSERT_FAILED_int_MUST_BE_8_BYTES’ is negative
#+END_EXAMPLE

当然错误信息并不是非常的优美，但是已经提供了足够多的信息了。不过这种编译断言可能只是比较适合用于简单断言比如sizeof等，对于复杂断言话可能还是需要依赖于configure这种工具比如系统是否有libunwind库。

c++0x(--std=c++0x)在语言层面上支持static_assert.

*** 各种cast
学习C的时候总是认为强转不过就是二进制层面的强转。开始学习C++之后就认为C语言的强转对应的就是reinterpret_cast.而static_cast和reinterpret_cast的差别不过就是static_cast可以做一些类型上面的检查，所以在大多数的时候都习惯使用reinterpret_cast而非static_cast.直到在编写itachi（一个异步网络编程框架）的时候，才发现并不是这么回事。下面的例子是我遇到问题的一个抽象。

**** 问题抽象
#+BEGIN_SRC C++
#include <cstdio>
struct A{
}; // class A

struct B: public A{
  int g;
}; // class B

void onComplete(A* o){
  B* pb=reinterpret_cast<B*>(o);
  printf("%p\n",&(pb->g));
}

int main() {
  B b;
  onComplete(&b);
  printf("%p\n",&(b.g));
  return 0;
}

#+END_SRC

运行结果是
#+BEGIN_EXAMPLE
[dirlt@localhost ~]$ ./a.out
0xbff031b0
0xbff031b0
#+END_EXAMPLE

在onComplete这里我们希望处理一个A*抽象类型。假设我们从外围上面保证传入onComplete是一个B或者是B的子类型。

**** 多重继承
处理B类型没有问题，但是处理B的子类型的话，那么上面代码可能就会出现问题。因为对于B子类型而言的话很可能在 *对象模型* 之前添加了一些字段，按照reintrepret_cast语义的话是直接二进制映射，字段没有虚方法所以是直接按照偏移来取的，因此可能存在问题。但是看看下面这个例子
#+BEGIN_SRC C++
#include <cstdio>
struct A{
}; // class A

struct B: public A{
  int g;
}; // class B

struct Holder{
  int dummy;
};
struct C: public Holder,
          public B{
}; // class C

void onComplete(A* o){
  B* pb=reinterpret_cast<B*>(o);
  printf("o:%p pb->g:%p\n",pb, &(pb->g));
}

int main() {
  C c;
  onComplete(&c);
  printf("c:%p c.g:%p\n",&c, &(c.g));
  return 0;
}
#+END_SRC

运行结果
#+BEGIN_EXAMPLE
[dirlt@localhost ~]$ ./a.out
o:0xbfff9aa0 pb->g:0xbfff9aa0
c:0xbfff9a9c c.g:0xbfff9aa0
#+END_EXAMPLE

问题出来了，并不像我们想的那样，pb->g和c.g的地址是一样的。但是神奇的是，o和c的地址是不一样的。这是为什么呢？原因就在于static_cast.在传参的时候，根据形参和实参之间的类型信息来进行指针的转换。 *也就是说，static_cast能够正确处理类型系统。而这点reintrepret_cast是做不到的。*

**** 正确使用cast
*因为自己也缺乏C++对象模型方面的知识，所以也没有办法从底层解释原因。* 但是结论却非常简单，就是应该尽量地执行static_cast而非reinterpret_cast. reinterpret_cast对于继承方面基本没有做任何事情，而使用static_cast的话则能够检测到类型系统，然后根据类型系统来进行正确的转换。 要是想对于static_cast有更多认识的话，需要了解C++对象模型的实现。

下面我总结了一下各种cast应该使用的场景：
   1. static_cast无论如何应该首先考虑使用，而且编译器在生成函数调用时候内部也是在用static_cast.
   2. reinterpret_cast只有在你确定只处理某两种final类型时候，两者之间的转换。比如在内存操作时候uint8_t*和char*之间的转换
   3. const_cast只有在消除const以及volatile这些标记时候有用。
   4. dynamic_cast得到父类型但是不确定子类型的时候，你需要逐个尝试转换可以使用。但是如果外部存在字符串比如type这样的字段表示类型的话，那么可以直接使用static_cast.

** runtime
