html/cpp.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> runtime</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> local static object</h3>
<div class="outline-text-3" id="text-3-1">
<p>
局部静态对象在C里面初始化只允许是常数，所以这个在编译期就可以搞定。在C++里面局部静态对象允许是一个类对象，那么就涉及到类的初始化等问题，这个是在编译期搞不定的只能够在运行期解决。
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">class</span> <span class="org-type">A</span>{
 <span class="org-keyword">public</span>:
  <span class="org-function-name">A</span>(){
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"A()"</span> &lt;&lt; <span class="org-constant">std</span>::endl;
  }
};
<span class="org-type">void</span> <span class="org-function-name">foo</span>(){
  <span class="org-keyword">static</span> <span class="org-type">A</span> <span class="org-variable-name">a</span>;
}
<span class="org-type">int</span> <span class="org-function-name">main</span>(){
  foo();
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
我们考虑局部静态对象的初始化时机。如果仅仅是在程序启动时候就初始化的话那么肯定不合适，所以肯定是在第一次调用foo时候进行初始化(这里还需要考虑多线程问题).我们可以看看这个部分汇编代码.对于a对象的话好比存在一个instance_counter初始化为0.首先判断是否初始化了，然后会调用__cxa_guard_acquire加锁然后再判断一次(double check,可以减少开销），最后使用__cxa_guard_release释放这个锁。
</p>

<div class="org-src-container">

<pre class="src src-ASM">.globl _Z3foov
    .type   _Z3foov, @function
_Z3foov:
.LFB1445:
    pushq   %rbp
.LCFI3:
    movq    %rsp, %rbp
.LCFI4:
    subq    $32, %rsp
.LCFI5:
    cmpb    $0, _ZGVZ3foovE1a(%rip)
    jne .L10
    movl    $_ZGVZ3foovE1a, %edi
    call    __cxa_guard_acquire
    testl   %eax, %eax
    je  .L10
    movb    $0, -1(%rbp)
    movl    $_ZZ3foovE1a, %edi
.LEHB0:
    call    _ZN1AC1Ev
.LEHE0:
    movl    $_ZGVZ3foovE1a, %edi
    call    __cxa_guard_release
    jmp .L10
.L19:
    movq    %rax, -24(%rbp)
.L13:
    movq    -24(%rbp), %rax
    movq    %rax, -16(%rbp)
    cmpb    $0, -1(%rbp)
    je  .L15
    jmp .L16
.L15:
    movl    $_ZGVZ3foovE1a, %edi
    call    __cxa_guard_abort
.L16:
    movq    -16(%rbp), %rax
    movq    %rax, -24(%rbp)
.L17:
    movq    -24(%rbp), %rdi
.LEHB1:
    call    _Unwind_Resume
.LEHE1:
.L10:
    leave
    ret
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> hook function</h3>
<div class="outline-text-3" id="text-3-2">
<p>
hook函数调用有两种方式，一种是hook我们代码内部的函数，这意味这这个函数是由我们来编译的，当然我们不能够修改需要hook的函数实现否则就没有意义了。另外一种hook函数是动态库里面的函数，静态库里面的函数因为完全进入了可执行程序，所以修改起来比较麻烦一些。我们QA写过这样的程序用libbfd库修改可执行程序本身，在函数调用之间加上跳板，但是相比本文介绍的两种方式更加复杂。（复杂就以为着容易出错，而且这种修改可执行程序应该是不值得提倡的）。
</p>

<p>
<b>编译时hook</b>
</p>

<p>
在gcc编译的时候需要加入-finstrument-functions这个选项之后，那么每个函数调用之前和之后都会调用
</p>
<ul class="org-ul">
<li>__cyg_profile_func_enter
</li>
<li>__cyg_profile_func_exit
</li>
</ul>
<p>
这两个函数是gcc内置函数，_enter函数能够在函数调用之前进行调用，_exit函数能够在函数调用退出之后调用，原型分别是
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">// </span><span class="org-comment">this&#26159;&#36825;&#20010;callee&#20989;&#25968;&#22320;&#22336;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">callsite&#26159;caller&#20989;&#25968;&#35843;&#29992;&#28857;&#22320;&#22336;(&#19981;&#26159;&#20989;&#25968;&#22320;&#22336;)</span>
<span class="org-type">void</span> <span class="org-function-name">__cyg_profile_func_enter</span>(<span class="org-type">void</span> *<span class="org-keyword">this</span>, <span class="org-type">void</span> *<span class="org-variable-name">callsite</span>);
<span class="org-type">void</span> <span class="org-function-name">__cyg_profile_func_exit</span>(<span class="org-type">void</span> *<span class="org-keyword">this</span>, <span class="org-type">void</span> *<span class="org-variable-name">callsite</span>);
</pre>
</div>

<p>
如果不希望函数被hook的话，那么可以在函数属性之后加上__attribute__((no _instrument _function)).尤其是这个函数如果在enter和exit里面调用的话，最好加上这个属性，不然非常容易出现递归调用
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;cstdio&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;cstdlib&gt;</span>
<span class="org-type">void</span> <span class="org-function-name">foo</span>() <span class="org-keyword">__attribute__</span>((no_instrument_function));
<span class="org-type">void</span> <span class="org-function-name">foo</span>() {
    printf(<span class="org-string">"%s\n"</span>,__func__);
}
<span class="org-type">int</span> <span class="org-function-name">main</span>() {
    printf(<span class="org-string">"main\n"</span>);
    <span class="org-keyword">return</span> 0;
}
<span class="org-keyword">extern</span> <span class="org-string">"C"</span> {
    <span class="org-type">void</span> <span class="org-function-name">__cyg_profile_func_enter</span>(<span class="org-type">void</span>* <span class="org-variable-name">callee</span>, <span class="org-type">void</span>* <span class="org-variable-name">callsite</span>)  <span class="org-keyword">__attribute__</span>((no_instrument_function));
    <span class="org-type">void</span> <span class="org-function-name">__cyg_profile_func_exit</span>(<span class="org-type">void</span>* <span class="org-variable-name">callee</span>, <span class="org-type">void</span>* <span class="org-variable-name">callsite</span>) <span class="org-keyword">__attribute__</span>((no_instrument_function));
    <span class="org-type">void</span> <span class="org-function-name">__cyg_profile_func_enter</span>(<span class="org-type">void</span>* <span class="org-variable-name">callee</span>, <span class="org-type">void</span>* <span class="org-variable-name">callsite</span>) {
        foo();
    }
    <span class="org-type">void</span> <span class="org-function-name">__cyg_profile_func_exit</span>(<span class="org-type">void</span>* <span class="org-variable-name">callee</span>, <span class="org-type">void</span>* <span class="org-variable-name">callsite</span>){
        foo();
    }
}
</pre>
</div>

<p>
<b>运行时hook</b>
</p>

<p>
可以使用dlopen截获函数入口，然后使用dlsym(RTLD_NEXT)来获得下一个入口.我们以截获malloc为例。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;unistd.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;dlfcn.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;cstring&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;cstdlib&gt;</span>

<span class="org-type">void</span>* <span class="org-function-name">malloc</span>(<span class="org-type">size_t</span> <span class="org-variable-name">size</span>){
    write(2,<span class="org-string">"do malloc\n"</span>,strlen(<span class="org-string">"do malloc\n"</span>)+1); <span class="org-comment-delimiter">// </span><span class="org-comment">&#36825;&#37324;&#19981;&#33021;&#22815;&#29992;printf,&#22240;&#20026;&#20869;&#37096;&#21487;&#33021;&#20250;&#35843;&#29992;malloc</span>
    <span class="org-keyword">static</span> <span class="org-type">void</span>* (*<span class="org-function-name">pmalloc</span>)(<span class="org-type">size_t</span> <span class="org-variable-name">size</span>)=0;
    <span class="org-keyword">if</span>(<span class="org-negation-char">!</span>pmalloc){
        pmalloc=(<span class="org-type">void</span>*(*)(<span class="org-type">size_t</span> <span class="org-variable-name">size</span>))(dlsym(RTLD_NEXT,<span class="org-string">"malloc"</span>));
    }
    <span class="org-keyword">return</span> pmalloc(size);
}

<span class="org-type">void</span> <span class="org-function-name">free</span>(<span class="org-type">void</span> *<span class="org-variable-name">p</span>){
    write(2,<span class="org-string">"do free\n"</span>,strlen(<span class="org-string">"do free\n"</span>)+1);
    <span class="org-keyword">static</span> <span class="org-type">void</span> (*<span class="org-function-name">pfree</span>)(<span class="org-type">void</span>* <span class="org-variable-name">p</span>)=0;
    <span class="org-keyword">if</span>(<span class="org-negation-char">!</span>pfree){
        pfree=(<span class="org-type">void</span>(*)(<span class="org-type">void</span>* <span class="org-variable-name">p</span>))(dlsym(RTLD_NEXT,<span class="org-string">"free"</span>));
    }
    <span class="org-keyword">return</span> pfree(p);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> undefined reference to static const class member</h3>
<div class="outline-text-3" id="text-3-3">
<p>
类型静态常量成员只允许是标量内容,而不允许是字符串数组或者是结构体等。但是下面代码会存在链接问题
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;vector&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;
<span class="org-keyword">class</span> <span class="org-type">Foo</span> {
 <span class="org-keyword">public</span>:
  <span class="org-keyword">static</span> <span class="org-keyword">const</span> <span class="org-type">int</span> <span class="org-variable-name">MEMBER</span> = 1;
};

<span class="org-type">int</span> <span class="org-function-name">main</span>(){
  <span class="org-type">vector</span>&lt;<span class="org-type">int</span>&gt; <span class="org-variable-name">v</span>;
  v.push_back( <span class="org-constant">Foo</span>::MEMBER );       <span class="org-comment-delimiter">// </span><span class="org-comment">undefined reference to `Foo::MEMBER'</span>
  v.push_back( (<span class="org-type">int</span>) <span class="org-constant">Foo</span>::MEMBER ); <span class="org-comment-delimiter">// </span><span class="org-comment">OK</span>
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
关于这个问题解释可以参看 <a href="http://stackoverflow.com/questions/272900/c-undefined-reference-to-static-class-member">http://stackoverflow.com/questions/272900/c-undefined-reference-to-static-class-member</a>
</p>

<p>
大致解释是这样，对于第一种用法的话，因为push_back需要是一个const int&amp;,因为需要传入的内容存在地址。而这种情况下面MEMBER仅仅是一个constant,没有任何地址所以会出现链接错误。而对于第二种情况的话，因为强制转换之后那么就存在一个临时对象可以被引用。说到这里我们一定需要注意临时对象，好比下面这种用法
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>
<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">s1</span>=<span class="org-string">"h"</span>;
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">s2</span>=<span class="org-string">"o"</span>;
  <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">s</span>=(s1+s2).c_str();
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>
<p>
这里(s1+s2)生成了一个临时对象但是却没有存放的内容，所以后续继续引用s是会出问题的。
</p>
</div>
</div>
