html/cpp.html

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> malloc warmup performance</h3>
<div class="outline-text-3" id="text-3-4">
<p>
下面是我之前碰到的因为malloc warmup导致的性能差异巨大的问题。
</p>

<p>
程序有两个函数，action是为了测试一下以string为key的map性能，action2是为了测试一下以int为key的map性能。然后我们分两组测试运行：
</p>
<ul class="org-ul">
<li>运行action，然后运行action2
</li>
<li>只运行action2
</li>
</ul>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-comment-delimiter">/* </span><span class="org-comment">coding:utf-8</span>
<span class="org-comment"> * Copyright (C) dirlt</span>
<span class="org-comment"> */</span>

<span class="org-preprocessor">#include</span> <span class="org-string">&lt;sys/time.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;map&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;cstdio&gt;</span>

<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-keyword">static</span> <span class="org-keyword">inline</span> <span class="org-type">double</span> <span class="org-function-name">gettime_ms</span>() {
  <span class="org-keyword">struct</span> <span class="org-type">timeval</span> <span class="org-variable-name">tv</span>;
  gettimeofday(&amp;tv, <span class="org-constant">NULL</span>);
  <span class="org-keyword">return</span> tv.tv_sec * 1000.0 + tv.tv_usec * 0.001;
}

<span class="org-keyword">static</span> <span class="org-keyword">const</span> <span class="org-type">int</span> <span class="org-variable-name">NUMBER</span> = 10000000;
<span class="org-keyword">static</span> <span class="org-keyword">const</span> <span class="org-type">char</span>* <span class="org-variable-name">PREFIX</span> = <span class="org-string">"s"</span>;

<span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">action</span>() {
  <span class="org-type">double</span> <span class="org-variable-name">start</span> = gettime_ms();
  <span class="org-type">map</span>&lt;<span class="org-type">string</span>, <span class="org-type">long</span>&gt; <span class="org-variable-name">dict</span>;
  <span class="org-type">char</span> <span class="org-variable-name">buf</span>[64];
  <span class="org-type">char</span> <span class="org-variable-name">buf2</span>[64];
  <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; NUMBER; i++) {
    snprintf(buf, <span class="org-keyword">sizeof</span>(buf), <span class="org-string">"%s%d"</span>, PREFIX, i);
    dict[buf] = i;
  }
  <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; NUMBER; i++) {
    snprintf(buf, <span class="org-keyword">sizeof</span>(buf), <span class="org-string">"%s%d"</span>, PREFIX, i);
    snprintf(buf2, <span class="org-keyword">sizeof</span>(buf2), <span class="org-string">"%s%d"</span>, PREFIX, (i + 1000) % NUMBER);
    dict[buf] += dict[buf2];
  }
  <span class="org-type">double</span> <span class="org-variable-name">end</span> = gettime_ms();
  printf(<span class="org-string">"%.2lf\n"</span>, end - start);
}

<span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">action2</span>() {
  <span class="org-type">double</span> <span class="org-variable-name">start</span> = gettime_ms();
  <span class="org-type">map</span>&lt;<span class="org-type">int</span>, <span class="org-type">long</span>&gt; <span class="org-variable-name">dict</span>;
  <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; NUMBER; i++) {
    dict[i] = i;
  }
  <span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; NUMBER; i++) {
    dict[i] += dict[(i + 1000) % NUMBER];
  }
  <span class="org-type">double</span> <span class="org-variable-name">end</span> = gettime_ms();
  printf(<span class="org-string">"%.2lf\n"</span>, end - start);
}

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  action();
  action2();
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
在自己的Ubuntu机器下面使用g++4.6编译运行结果如下。可以看到测试组1里面action2运行时间为2.9s左右，而测试组2里面action2运行时间为8.5s 时间差别很大
</p>
<pre class="example">
➜  tomb git:(master) ✗ g++ map_perf_test.cc -O2
➜  tomb git:(master) ✗ ./a.out
19764.38
2957.30
➜  tomb git:(master) ✗ g++ map_perf_test.cc -O2
➜  tomb git:(master) ✗ ./a.out
8521.25
</pre>

<p>
可能是编译器的原因？ 在自己的Ubuntu机器下面clang++来编译，时间差别同样很大
</p>
<pre class="example">
➜  tomb git:(master) ✗ clang++ map_perf_test.cc -O2
➜  tomb git:(master) ✗ ./a.out
19494.99
3052.83
➜  tomb git:(master) ✗ clang++ map_perf_test.cc -O2
➜  tomb git:(master) ✗ ./a.out
8495.00
</pre>

<p>
在自己的macbook air下面使用clang重新编译，时间是差不多的
</p>
<pre class="example">
➜  tomb git:(master) ✗ g++ map_perf_test.cc -O2
➜  tomb git:(master) ✗ ./a.out
22759.82
4203.22
tomb git:(master) ✗ g++ map_perf_test.cc -O2
➜  tomb git:(master) ✗ ./a.out
4214.48
</pre>

<p>
另外我让同事在其他机器上使用g++3.4.5编译运行，时间差别也非常大
</p>

<p>
多谢 @Thomas 的指导，通过strace发现确实是glibc的内存分配问题。strace两个binary发现：
</p>
<ul class="org-ul">
<li>action调用了很多brk（8288次）,mmap（17次）来分配内存，每次都是分配小内存.运行完成之后这些内存buffer起来了。
</li>
<li>在action调用之后的action2没有调用任何系统调用分配内存，都是在用户态完成。
</li>
<li>而如果没有action先调用的话，action2就需要自己调用brk（4737次）,mmap（17次），所以比较耗时。
</li>
</ul>
<p>
改用 <a href="tcmalloc.html">tcmalloc</a> 之后没有这个问题了。tcmalloc调用brk（541次），mmap（500次）。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> library</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> boost::bind</h3>
<div class="outline-text-3" id="text-4-1">
<p>
之前看到陈硕同学在<a href="http://blog.csdn.net/solstice/">博客</a> 给出的C++工程实践推荐，使用boost::function和boost::bind代替虚函数。之所以我们需要使用虚函数，无非就是希望统一执行接口。统一接口通过虚函数是一种方法，而使用boost::function和boost::bind也可以达到相同的目的。
</p>

<p>
首先我们假设存在一个Executor类，里面有一个执行队列，所有的Task首先被push进来然后遍历执行。对于这个Task我们本身只需要一个执行接口void fun(Executor*).如果通过虚函数实现的话，我们需要定义一个abstract class含有virtual函数，然后在具体的类里面实现它。但是如果很不幸的话我们原本定义的类不是这样的，而是
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">class</span> <span class="org-type">A</span>{
 <span class="org-keyword">public</span>:
  <span class="org-type">void</span> <span class="org-function-name">fun</span>(<span class="org-type">Executor</span>* <span class="org-variable-name">x</span>,<span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">s</span>){
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"executor="</span> &lt;&lt; x &lt;&lt; <span class="org-string">", s="</span> &lt;&lt; s &lt;&lt; <span class="org-constant">std</span>::endl;
  }
}; <span class="org-comment-delimiter">// </span><span class="org-comment">class A</span>

<span class="org-keyword">class</span> <span class="org-type">B</span>{
 <span class="org-keyword">public</span>:
  <span class="org-type">void</span> <span class="org-function-name">fun</span>(<span class="org-type">Executor</span>* <span class="org-variable-name">x</span>,<span class="org-type">int</span> <span class="org-variable-name">s</span>){
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"executor="</span> &lt;&lt; x &lt;&lt; <span class="org-string">", s="</span> &lt;&lt; s &lt;&lt; <span class="org-constant">std</span>::endl;
  }
}; <span class="org-comment-delimiter">// </span><span class="org-comment">class B</span>
</pre>
</div>

<p>
那我们必须重新定义AdapterA以及AdapterB封装一下。实现上可能非常简单，内部存下std::string以及int的内容，外加一个A,B的指针，在fun里面调用A,B的fun实现并且把内容传进去调用。
</p>

<p>
这是一种蹩脚的方法，类的个数会急剧膨胀。但是如果我们使用boost::function和boost::bind的话，可以不用添加新的Adapter类来解决这个问题。
</p>
<div class="org-src-container">

<pre class="src src-C++">x.push(<span class="org-constant">boost</span>::bind(&amp;<span class="org-constant">A</span>::fun,&amp;a,_1,<span class="org-string">"hello"</span>));
x.push(<span class="org-constant">boost</span>::bind(&amp;<span class="org-constant">A</span>::fun,&amp;a,_1,<span class="org-string">"world"</span>));
x.push(<span class="org-constant">boost</span>::bind(&amp;<span class="org-constant">B</span>::fun,&amp;b,_1,123));
x.push(<span class="org-constant">boost</span>::bind(&amp;<span class="org-constant">B</span>::fun,&amp;b,_1,456));
</pre>
</div>

<p>
这里_1是boost::bind导出的符号表示占位符，这个参数表示接口中的第一个参数，这里不进行绑定。第一个参数表示函数地址，如果是成员函数的话那么需要传入对象地址（这里对于对象内存管理的话，可能需要智能指针的帮助。可以参考<a href="http://xuchaoqian.com/?p=797">http://xuchaoqian.com/?p=797</a>)。事实上稍微猜想一下boost::function和boost::bind实现，boost::function用于产生新的类型，boost::bind用于产生这个类型的对象，并且将指针以及所需要的closure context都绑定上去。我本来想实现的，但是发现基于模板的元编程，我确实不会:(
</p>

<p>
之后我在想，虽然这个方式不错消除继承完全按照基于对象的方式编程，但是如果对于对象所需要的接口非常多的话，并且虚函数本身就是语言内置的特性，相对来说使用起来会更加方便。下面是可编译的示例代码之后我在想，虽然这个方式不错消除继承完全按照基于对象的方式编程，但是如果对于对象所需要的接口非常多的话，并且虚函数本身就是语言内置的特性，相对来说使用起来会更加方便。
</p>

<p>
UPDATE: 现在C++17已经内置了 <code>std::bind</code> , 使用方法上和boost差不多。
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> boost::python</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<a href="http://www.boost.org/doc/libs/1_58_0/libs/python/doc/index.html">http://www.boost.org/doc/libs/1_58_0/libs/python/doc/index.html</a>
</p>

<p>
编写Python Extension. 具体代码可以参考 <a href="https://github.com/dirtysalt/codes/tree/master/cc/misc/test_pye.cc">code on github</a>
</p>
</div>
</div>
