html/cpp.html

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 几个logging实现</h3>
<div class="outline-text-3" id="text-4-3">
<p>
@2015-07-26 最近一段时间使用C++编写Python扩展时候，发现原来的日志库(easyloggingpp)封装存在一些问题。修改完成日志库的封装之后，顺便就看了一下C/C++下面有什么可用的日志库。我粗略地看了下面几种，然后总结了一下优缺点以及自己的想法。
</p>

<p>
<a href="https://github.com/easylogging/easyloggingpp">https://github.com/easylogging/easyloggingpp</a> easylogging++
</p>
<ul class="org-ul">
<li>一个头文件，可以很容易集成
</li>
<li>设计上没有Handler, Filter, Formatter这样的概念，相对比较简单直接
</li>
<li>多个Logger之间是平级关系，没有层次关系，虽然可以共享配置
</li>
<li>内置直接输出到文件，但是不支持rotate这样操作（需要自己编写callback）
</li>
<li>可以通过添加回调来扩展打印日志方法，但是回调函数列表是全局而非单个Logger所有
</li>
<li>简单好用，容易集成，支持多模块输出，需要自己编写代码来扩展功能
</li>
</ul>

<p>
<a href="http://code.google.com/p/google-glog/">http://code.google.com/p/google-glog/</a> google-glog
</p>
<ul class="org-ul">
<li>时间有限只能从 <a href="http://google-glog.googlecode.com/svn/trunk/doc/glog.html">官方文档</a> 来了解其功能
</li>
<li>glog更像是为C++程序定制的，不支持多模块输出
</li>
<li>可以选择输出到标准错误或者是文件，文件默认是在""/tmp/&lt;program name&gt;.&lt;hostname&gt;.&lt;user name&gt;.log.&lt;severity level&gt;.&lt;date&gt;.&lt;time&gt;.&lt;pid&gt;". 这意味着不需要考虑rotate。用户可以指定输出文件的路径但是不能修改文件名称
</li>
<li>从文档上看没有提供扩展能力（代码可能会有这个功能，但是需要用户阅读代码来扩展）
</li>
<li>对C++程序简单好用，容易集成，扩展能力比较差只支持输出文件（但是如果考虑到G还有 <a href="gwp.html">其他</a> <a href="dapper.html">系统</a> 来辅助日志分析的话，其实这个不是问题）
</li>
</ul>

<p>
log4cpp/log4cplus/log4cxx # log4j的C++实现.
</p>
<ul class="org-ul">
<li>从功能上来说是最强大的，支持多模块输出，也很容易集成，只是没有那么好用
</li>
<li>设计上有Handler, Filter, Formatter这样的概念，设计考虑上非常周到
</li>
<li>网上有不少关于如何具体使用log4cxx的文章，但是很少有谈论其设计的文章。设计方面可以阅读一下 <a href="https://docs.python.org/3/library/logging.html?highlight=logging#module-logging">python logging</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> C++11 update</h2>
<div class="outline-text-2" id="text-5">
<p>
C++11在C++03上做了许多改进，而且都是非常实用的改进。BS在自己的主页上列出了这些改进的 <a href="http://www.stroustrup.com/C++11FAQ.html">细节</a>, 有位国内开发者把它翻译成了 <a href="http://www.chenlq.net/cpp11-faq-chs">中文</a> (非常感谢).
</p>

<p>
下面这几篇文章介绍了其中一些对于大部分C++使用者来说会更加关心的改进
</p>
<ul class="org-ul">
<li>Continuous Learning : C++ 11 Tutorial : <a href="http://learnandexperiment.blogspot.com/2013/07/c-11-tutorial.html">http://learnandexperiment.blogspot.com/2013/07/c-11-tutorial.html</a>
</li>
<li>Ten C++11 Features Every C++ Developer Should Use - CodeProject : <a href="http://www.codeproject.com/Articles/570638/Ten-Cplusplus-Features-Every-Cplusplus-Developer">http://www.codeproject.com/Articles/570638/Ten-Cplusplus-Features-Every-Cplusplus-Developer</a>
</li>
<li>The Biggest Changes in C++11 (and Why You Should Care) : <a href="http://blog.smartbear.com/c-plus-plus/the-biggest-changes-in-c11-and-why-you-should-care/">http://blog.smartbear.com/c-plus-plus/the-biggest-changes-in-c11-and-why-you-should-care/</a>
</li>
</ul>

<p>
这里我把文章里面所涉及的改进全部列了出来
</p>
<ul class="org-ul">
<li>auto. auto是C的关键字，表示变量空间是自动分配的（相对应的是regsiter），但是实际上几乎所有的编译器都忽略这个关键字。在C++11里面给这个关键字赋予了新的语义，就是做类型推导。
</li>
<li>decltype. decltype(expression)可以返回expression的类型定义。在C++03的时候，如果想获得某个表达式的类型的话，只能使用g++扩展关键字typeof(expression).
</li>
<li>nullptr. C++11引入的空指针关键字，类型是std::nullptr_t. nullptr可以隐式转换为任意指针类型以及bool类型，但是却不能够转换为int类型了(之前NULL本身就是#define NULL (0)).
</li>
<li>strongly-typed enums. C++03会把enum class 1. 定义对象导出到外部作用域（可能会出现名字冲突）2. 隐式地将枚举对象转换为整数值 3. 不创建这个枚举类型。C++11取消了这些特殊处理。
</li>
<li>override/final. 这两个关键字只有出现在成员函数声明最后如void foo() [&#x2026;]才有用。override要解决的问题是，确保这个函数是重写(override)而不是重载(overload)子类中的某个虚函数. final则是希望某个虚函数不要被重写(override).
</li>
<li>default/delete. 这两个关键字同样要出现在成员函数声明之后入void foo() = [&#x2026;]. 通常作用在构造函数上。default告诉编译器为这个函数生成默认实现. delete则告诉编译器删除这个函数实现（禁止拷贝或赋值构造）
</li>
<li>static_assert/type_traits. type_traits提供一系列template function来对类型做判断. 在C++03做静态断言static_assert需要使用workaround办法，但是在C++11就直接提供了。
</li>
<li>delegating constructors. 代理构造函数.
</li>
<li>range-based for statement. 可以使用for(auto&amp; e: v)这种简洁的语法来编译容器
</li>
<li>uniform initialization syntax. 统一的初始化语法，全部使用{}来包含参数。比如构造函数是A(int a, float b)的话，可以使用A a{1, 2.3};来构造对象
</li>
<li>in-class member initializers. 类成员的内部初始化。类成员初始化可以不用在构造函数内完成，可以直接在类的内部完成初始化（必须是编译期可以确定的常量表达式）
</li>
<li>inline namespace. 内联名字空间。如果一个名字空间是inline namespace XXX定义的，并且被包含在namespace YYY里面的话，那么XXX内部成员f可以使用YYY::f引用，也可以使用YYY::XXX::f引用（可以处理代码向后兼容问题）
</li>
<li>initializer lists. 初始化列表。许多stl容器比如vector, map支持初始化列表，也就是说可以这样vector&lt;int&gt; a {1,2,3};来构造。初始化列表具体类型是std::initializer_list&lt;E&gt;.
</li>
<li>right-angle brackets. 右角括号这个问题在C++03非常恼人，就是写嵌套容器时必须这样vector&lt;vector&lt;A&gt; &gt;. C++11解决了这个问题
</li>
<li>除此之外还有suffix return type syntax, rvalue reference and move semantics, lambda expression等一些改进放在后面单独说
</li>
</ul>

<p>
使用&lt;thread&gt;必须加上编译参数-pthread.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> suffix return type syntax(返回值类型后置语法)</h3>
<div class="outline-text-3" id="text-5-1">
<p>
一开始我以为这个语法，是为了解决编写模板函数的时候，auto不能自动推导函数返回类型而设计的。比如下面这段程序
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">typename</span> <span class="org-type">T1</span>, <span class="org-keyword">typename</span> <span class="org-type">T2</span>&gt;
<span class="org-keyword">auto</span> <span class="org-function-name">bar</span>(<span class="org-keyword">const</span> <span class="org-type">T1</span> <span class="org-variable-name">a</span>, <span class="org-keyword">const</span> <span class="org-type">T2</span> <span class="org-variable-name">b</span>) -&gt; <span class="org-keyword">decltype</span>(a + b) {
    <span class="org-keyword">return</span> a + b;
}
</pre>
</div>
<p>
如果我们不使用"-&gt; decltype(a+b)"这个后置语法的话，那么编译器就不知道bar应该返回什么类型。但是事实却是，编译器已经足够强大到推测返回类型了，所以我们不告诉编译器返回值类型也可以（但是会有warning）
</p>

<p>
实际按照BS的 <a href="http://www.stroustrup.com/C++11FAQ.html#suffix-return">想法</a>, 一开始这个语法的引入，却是为了解决作用域问题的。比如下面这段程序
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">class</span> <span class="org-type">A</span> {
  <span class="org-keyword">public</span>:
    <span class="org-keyword">class</span> <span class="org-type">B</span> {};
    <span class="org-type">B</span> <span class="org-function-name">foo</span>();
};

<span class="org-comment-delimiter">// </span><span class="org-comment">A::B A::foo() { return B(); }</span>
<span class="org-keyword">auto</span> <span class="org-constant">A</span>::<span class="org-function-name">foo</span>() -&gt; <span class="org-type">B</span> { <span class="org-keyword">return</span> B(); }
</pre>
</div>
<p>
如果我们按照第一种写法编写foo的话，返回值必须写明A::B, 因为再此之前还没有进去A作用域所以要写全名。而使用第二种写法的话，因为我们已经限定了在A作用域下，所以返回类型可以直接写B
</p>
</div>
</div>
