src/cpp.org
*** lambda expression(lambda表达式，匿名函数)

语法大致是这样的[capture](parameters) [-> suffix-return-type] { body }. 就像之前说的那样，C++11类型推导能力非常强大，所以suffix-return-type通常是可选的。
- capture 是指我们需要捕获哪些外部变量
- parameters 则是匿名函数的参数列表
- body 则是匿名函数的函数体
在capture这个部分中，&v表示使用变量v的引用，=v表示使用v的copy(read-only). 如果是[&]表示所有外部变量的使用都是引用方式，如果是[=]表示所有外部变量使用都是传值方式。

匿名函数类型是std::function<[actual-type>].(defined in <functional>). 比如[](int a, int b) { return a + b; }的类型就是std::function<int(int,int)>. 虽然匿名函数可以捕获变量，但是并不意味着实现了闭包。下面这个程序中，lambda引用了count，但是在调用的时候count已经被销毁了，所以会出现运行错误。
#+BEGIN_SRC C++
#include <functional>
#include <iostream>
using namespace std;

std::function<int()> foo() {
    int count = 0;
    auto f = [&count]() {
        count += 1;
        return count;
    };
    return f;
}

int main() {
    auto f = foo();
    auto x = f();
    // cout << x << endl;
}
#+END_SRC

这里还想说一下就是，C++11也把bind纳入stl了（smart pointers, atomic, thread这些原来都在boost的组件都纳入stl了）.
#+BEGIN_SRC C++
#include <functional>
#include <iostream>
using namespace std;
using std::placeholders::_1;
using std::placeholders::_2;
using std::placeholders::_3;
int foo(int a, int b, int c) {
    return a + b + c;
}
int main() {
    auto f1 = bind(foo, 1, 2, _1);
    auto f2 = bind(foo, _1, _2, 3);
    cout << f1(10) << ", " << f2(2,4) << endl;
    return 0;
}
#+END_SRC

