html/cpp.html

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> lambda expression(lambda表达式，匿名函数)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
语法大致是这样的[capture](parameters) [-&gt; suffix-return-type] { body }. 就像之前说的那样，C++11类型推导能力非常强大，所以suffix-return-type通常是可选的。
</p>
<ul class="org-ul">
<li>capture 是指我们需要捕获哪些外部变量
</li>
<li>parameters 则是匿名函数的参数列表
</li>
<li>body 则是匿名函数的函数体
</li>
</ul>
<p>
在capture这个部分中，&amp;v表示使用变量v的引用，=v表示使用v的copy(read-only). 如果是[&amp;]表示所有外部变量的使用都是引用方式，如果是[=]表示所有外部变量使用都是传值方式。
</p>

<p>
匿名函数类型是std::function&lt;[actual-type&gt;].(defined in &lt;functional&gt;). 比如[](int a, int b) { return a + b; }的类型就是std::function&lt;int(int,int)&gt;. 虽然匿名函数可以捕获变量，但是并不意味着实现了闭包。下面这个程序中，lambda引用了count，但是在调用的时候count已经被销毁了，所以会出现运行错误。
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;functional&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-constant">std</span>::<span class="org-type">function</span>&lt;<span class="org-type">int</span>()&gt; <span class="org-function-name">foo</span>() {
    <span class="org-type">int</span> <span class="org-variable-name">count</span> = 0;
    <span class="org-keyword">auto</span> <span class="org-variable-name">f</span> = [&amp;count]() {
        count += 1;
        <span class="org-keyword">return</span> count;
    };
    <span class="org-keyword">return</span> f;
}

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
    <span class="org-keyword">auto</span> <span class="org-variable-name">f</span> = foo();
    <span class="org-keyword">auto</span> <span class="org-variable-name">x</span> = f();
    <span class="org-comment-delimiter">// </span><span class="org-comment">cout &lt;&lt; x &lt;&lt; endl;</span>
}
</pre>
</div>

<p>
这里还想说一下就是，C++11也把bind纳入stl了（smart pointers, atomic, thread这些原来都在boost的组件都纳入stl了）.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;functional&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;
<span class="org-keyword">using</span> <span class="org-constant">std</span>::<span class="org-constant">placeholders</span>::<span class="org-type">_1</span>;
<span class="org-keyword">using</span> <span class="org-constant">std</span>::<span class="org-constant">placeholders</span>::<span class="org-type">_2</span>;
<span class="org-keyword">using</span> <span class="org-constant">std</span>::<span class="org-constant">placeholders</span>::<span class="org-type">_3</span>;
<span class="org-type">int</span> <span class="org-function-name">foo</span>(<span class="org-type">int</span> <span class="org-variable-name">a</span>, <span class="org-type">int</span> <span class="org-variable-name">b</span>, <span class="org-type">int</span> <span class="org-variable-name">c</span>) {
    <span class="org-keyword">return</span> a + b + c;
}
<span class="org-type">int</span> <span class="org-function-name">main</span>() {
    <span class="org-keyword">auto</span> <span class="org-variable-name">f1</span> = bind(foo, 1, 2, _1);
    <span class="org-keyword">auto</span> <span class="org-variable-name">f2</span> = bind(foo, _1, _2, 3);
    cout &lt;&lt; f1(10) &lt;&lt; <span class="org-string">", "</span> &lt;&lt; f2(2,4) &lt;&lt; endl;
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>
</div>
</div>
