html/cpp.html

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> rvalue references and move semantics(右值引用以及移动语义)</h3>
<div class="outline-text-3" id="text-5-3">
<p>
右值引用比较奇怪的一个地方是，你可以认为它是一个非常容易挥发的东西。因为一旦你使用A&amp;&amp; a = foo();获得右值引用的时候，其实你已经获得了左值a（并且发生了copy ctor或者是move ctor, 这个根据是否有move ctor决定的）. 只有在move ctor或者是move assignment时候我们才能够瞬间捕获到右值引用。想要把一个左值变为右值可以使用std::move函数。下面是我的实验代码，可以加深理解。
</p>

<p>
UPDATE@2021: 右值引用的类型写为 <code>A&amp;&amp; x</code>. 而 <code>std::move</code> 这个操作就是将类型从A类型变为A的右值引用类型。引入右值引用类型的目的是节省对象的拷贝开销，然后开发者可以在构造函数里面指明，如果是move语义的话应该如何进行对象构造。本质来说，就是允许开发者告诉编译器，我是希望copy还是move对象。
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;cstdio&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>

<span class="org-preprocessor">#if</span> (__cplusplus &gt; 199711L)
<span class="org-preprocessor">#define</span> <span class="org-variable-name">cxx0x</span>
<span class="org-preprocessor">#endif</span>

<span class="org-preprocessor">#include</span> <span class="org-string">&lt;memory&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;


<span class="org-keyword">class</span> <span class="org-type">A</span> {
  <span class="org-keyword">public</span>:
    <span class="org-type">int</span> <span class="org-variable-name">v</span>;
    <span class="org-type">string</span> <span class="org-variable-name">s</span>;
    <span class="org-function-name">A</span>(<span class="org-type">int</span> <span class="org-variable-name">v</span>, <span class="org-type">string</span> <span class="org-variable-name">s</span>){
        <span class="org-keyword">this</span> -&gt; v = v;
        <span class="org-keyword">this</span> -&gt; s = s;
        <span class="org-comment-delimiter">// </span><span class="org-comment">cout &lt;&lt; "ctor" &lt;&lt; endl;</span>
    }
    <span class="org-function-name">A</span>(<span class="org-keyword">const</span> <span class="org-type">A</span>&amp; <span class="org-variable-name">x</span>) {
        <span class="org-keyword">this</span>-&gt;v = x.v;
        <span class="org-keyword">this</span>-&gt;s = x.s;
        cout &lt;&lt; <span class="org-string">"copy ctor:"</span>;
        cout &lt;&lt; &amp;x &lt;&lt; <span class="org-string">" -&gt; "</span> &lt;&lt; <span class="org-keyword">this</span> &lt;&lt; endl;
    }
    <span class="org-type">A</span>&amp; <span class="org-keyword">operator</span><span class="org-function-name">=</span>(<span class="org-keyword">const</span> <span class="org-type">A</span>&amp; <span class="org-variable-name">x</span>) {
        <span class="org-keyword">this</span>-&gt;v = x.v;
        <span class="org-keyword">this</span>-&gt;s = <span class="org-constant">std</span>::move(x.s);
        cout &lt;&lt; <span class="org-string">"copy operator=:"</span>;
        cout &lt;&lt; &amp;x &lt;&lt; <span class="org-string">" -&gt; "</span> &lt;&lt; <span class="org-keyword">this</span> &lt;&lt; endl;
        <span class="org-keyword">return</span> *<span class="org-keyword">this</span>;
    }
<span class="org-preprocessor">#ifdef</span> cxx0x
    <span class="org-function-name">A</span>(<span class="org-type">A</span>&amp;&amp; <span class="org-variable-name">x</span>) {
        <span class="org-keyword">this</span>-&gt;v = x.v;
        <span class="org-keyword">this</span>-&gt;s = <span class="org-constant">std</span>::move(x.s);
        cout &lt;&lt; <span class="org-string">"move ctor:"</span>;
        cout &lt;&lt; &amp;x &lt;&lt; <span class="org-string">" -&gt; "</span> &lt;&lt; <span class="org-keyword">this</span> &lt;&lt; endl;
    }
    <span class="org-type">A</span>&amp; <span class="org-keyword">operator</span><span class="org-function-name">=</span>(<span class="org-type">A</span>&amp;&amp; <span class="org-variable-name">x</span>) {
        <span class="org-keyword">this</span>-&gt;v = x.v;
        <span class="org-keyword">this</span>-&gt;s = <span class="org-constant">std</span>::move(x.s);
        cout &lt;&lt; <span class="org-string">"move operator=:"</span>;
        cout &lt;&lt; &amp;x &lt;&lt; <span class="org-string">" -&gt; "</span> &lt;&lt; <span class="org-keyword">this</span> &lt;&lt; endl;
        <span class="org-keyword">return</span> *<span class="org-keyword">this</span>;
    }
<span class="org-preprocessor">#endif</span>
};

<span class="org-comment-delimiter">// </span><span class="org-comment">&#36825;&#37324;&#22686;&#21152;&#26465;&#20214;&#35821;&#21477;&#65292;&#21487;&#20197;&#20351;&#24471;&#32534;&#35793;&#22120;&#19981;&#20250;&#30452;&#25509;&#22312;&#36820;&#22238;&#22320;&#22336;&#19978;&#24320;&#36767;&#23545;&#35937;A</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#20174;&#32780;&#36798;&#21040;&#23454;&#39564;&#30446;&#30340;&#65292;&#21542;&#21017;&#21482;&#20250;&#35843;&#29992;&#19968;&#27425;ctor&#65288;&#20869;&#37096;&#30340;&#65289;&#32780;&#19981;&#20250;&#35843;&#29992;copy ctor/move ctor.</span>
<span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-variable-name">x</span> = 0;
<span class="org-type">A</span> <span class="org-function-name">bar</span>() {
    <span class="org-type">A</span> <span class="org-variable-name">a</span>(10, <span class="org-string">"hello, world"</span>);
    <span class="org-type">A</span> <span class="org-variable-name">b</span>(20, <span class="org-string">"hello, worldb"</span>);
    <span class="org-keyword">if</span> (x == 0) {
        cout &lt;&lt; <span class="org-string">"inside bar: "</span> &lt;&lt; &amp;a &lt;&lt; endl;
        <span class="org-keyword">return</span> a;
    } <span class="org-keyword">else</span> {
        cout &lt;&lt; <span class="org-string">"inside bar: "</span> &lt;&lt; &amp;b &lt;&lt; endl;
        <span class="org-keyword">return</span> b;
    }
}

<span class="org-preprocessor">#ifdef</span> cxx0x
<span class="org-type">int</span> <span class="org-function-name">foo1</span>() {
    cout &lt;&lt; <span class="org-string">"----- foo1(test c++0x) -----"</span> &lt;&lt; endl;
    <span class="org-type">A</span> <span class="org-function-name">pa</span>(<span class="org-type">bar</span>()); <span class="org-comment-delimiter">// </span><span class="org-comment">move ctor</span>
    cout &lt;&lt; <span class="org-string">"pa = "</span> &lt;&lt; &amp;pa &lt;&lt; <span class="org-string">"/"</span> &lt;&lt; &amp;(pa.v) &lt;&lt; endl;

    cout &lt;&lt; <span class="org-string">"-----"</span> &lt;&lt; endl;
    <span class="org-type">A</span> <span class="org-variable-name">pa2</span>(10, <span class="org-string">"s"</span>);
    pa2 = bar(); <span class="org-comment-delimiter">// </span><span class="org-comment">move ctor and move operator=</span>
    cout &lt;&lt; <span class="org-string">"pa = "</span> &lt;&lt; &amp;pa2 &lt;&lt; <span class="org-string">"/"</span> &lt;&lt; &amp;(pa2.v) &lt;&lt; endl;


    cout &lt;&lt; <span class="org-string">"-----"</span> &lt;&lt; endl;
    <span class="org-keyword">if</span> (<span class="org-constant">std</span>::<span class="org-constant">is_same</span>&lt;<span class="org-keyword">decltype</span>(pa), <span class="org-type">A</span>&amp;&amp;&gt;::value) {
        cout &lt;&lt; <span class="org-string">"same type"</span> &lt;&lt; endl;
    }
    <span class="org-type">A</span> <span class="org-variable-name">pb</span> = pa; <span class="org-comment-delimiter">// </span><span class="org-comment">copy ctor.</span>
    cout &lt;&lt; <span class="org-string">"pb = "</span> &lt;&lt; &amp;pb &lt;&lt; endl;

    cout &lt;&lt; <span class="org-string">"-----"</span> &lt;&lt; endl;
    <span class="org-type">A</span> <span class="org-variable-name">pc</span> = <span class="org-constant">std</span>::move(pb); <span class="org-comment-delimiter">// </span><span class="org-comment">move ctor.</span>
    cout &lt;&lt; <span class="org-string">"pc = "</span> &lt;&lt; &amp;pc &lt;&lt; endl;
    <span class="org-keyword">return</span> 0;
}
<span class="org-preprocessor">#endif</span>

<span class="org-type">int</span> <span class="org-function-name">foo2</span>() {
    cout &lt;&lt; <span class="org-string">"----- foo2(test c++03&amp;0x) ----"</span> &lt;&lt; endl;
    <span class="org-comment-delimiter">// </span><span class="org-comment">move ctor at c++0x</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">copy ctor at c++03</span>
    <span class="org-type">A</span> <span class="org-variable-name">pa</span> = bar();
    cout &lt;&lt; <span class="org-string">"pa = "</span> &lt;&lt; &amp;pa &lt;&lt; <span class="org-string">"/"</span> &lt;&lt; &amp;(pa.v) &lt;&lt; endl;

    <span class="org-comment-delimiter">// </span><span class="org-comment">move ctor / move operator= in c++0x.</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">copy ctor / copy operator= in c++03.</span>
    cout &lt;&lt; <span class="org-string">"-----"</span> &lt;&lt; endl;
    <span class="org-type">A</span> <span class="org-variable-name">pa2</span>(10, <span class="org-string">"s"</span>);
    pa2 = bar();
    cout &lt;&lt; <span class="org-string">"pa = "</span> &lt;&lt; &amp;pa &lt;&lt; <span class="org-string">"/"</span> &lt;&lt; &amp;(pa.v) &lt;&lt; endl;

    cout &lt;&lt; <span class="org-string">"-----"</span> &lt;&lt; endl;
    <span class="org-type">A</span> <span class="org-variable-name">pb</span> = pa; <span class="org-comment-delimiter">// </span><span class="org-comment">copy ctor.</span>
    cout &lt;&lt; <span class="org-string">"pb = "</span> &lt;&lt; &amp;pb &lt;&lt; endl;
    <span class="org-keyword">return</span> 0;
}

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
<span class="org-preprocessor">#ifdef</span> cxx0x
    foo1();
    cout &lt;&lt; endl &lt;&lt; endl;
<span class="org-preprocessor">#endif</span>
    foo2();
}
</pre>
</div>


<p>
针对上面的代码分别使用c++2a和c++03选项进行编译，主要是看foo2的输出上的差异。使用c++2a编译的输出结果如下，可以看到大部分地方都使用到了move操作。
</p>

<pre class="example">
mac :: ~/utils » g++ test2.cpp -std=c++2a ; ./a.out
----- foo1(test c++0x) -----
inside bar: 0x7ffee2b658d8
move ctor:0x7ffee2b658d8 -&gt; 0x7ffee2b65a40
pa = 0x7ffee2b65a40/0x7ffee2b65a40
-----
inside bar: 0x7ffee2b658d8
move ctor:0x7ffee2b658d8 -&gt; 0x7ffee2b659d8
move operator=:0x7ffee2b659d8 -&gt; 0x7ffee2b65a10
pa = 0x7ffee2b65a10/0x7ffee2b65a10
-----
copy ctor:0x7ffee2b65a40 -&gt; 0x7ffee2b659b8
pb = 0x7ffee2b659b8
-----
move ctor:0x7ffee2b659b8 -&gt; 0x7ffee2b65998
pc = 0x7ffee2b65998


----- foo2(test c++03&amp;0x) ----
inside bar: 0x7ffee2b65908
move ctor:0x7ffee2b65908 -&gt; 0x7ffee2b65a40
pa = 0x7ffee2b65a40/0x7ffee2b65a40
-----
inside bar: 0x7ffee2b65908
move ctor:0x7ffee2b65908 -&gt; 0x7ffee2b659d8
move operator=:0x7ffee2b659d8 -&gt; 0x7ffee2b65a10
pa = 0x7ffee2b65a40/0x7ffee2b65a40
-----
copy ctor:0x7ffee2b65a40 -&gt; 0x7ffee2b659b8
pb = 0x7ffee2b659b8
</pre>

<p>
而使用c++03编译的输出结果如下，可以看到foo2大部分地方都是copy操作。
</p>

<pre class="example">
mac :: ~/utils » g++ test2.cpp -std=c++03 ; ./a.out
----- foo2(test c++03&amp;0x) ----
inside bar: 0x7ffee9f60918
copy ctor:0x7ffee9f60918 -&gt; 0x7ffee9f60a50
pa = 0x7ffee9f60a50/0x7ffee9f60a50
-----
inside bar: 0x7ffee9f60918
copy ctor:0x7ffee9f60918 -&gt; 0x7ffee9f609e8
copy operator=:0x7ffee9f609e8 -&gt; 0x7ffee9f60a20
pa = 0x7ffee9f60a50/0x7ffee9f60a50
-----
copy ctor:0x7ffee9f60a50 -&gt; 0x7ffee9f609c8
pb = 0x7ffee9f609c8
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
